#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы 

&НаКлиенте
Процедура ТоварыПриИзмененииПосле(Элемент)
	РассчитатьСуммуБонусовНаФорме();
КонецПроцедуры

Процедура РассчитатьСуммуБонусовНаФорме()
	ЭтотОбъект.СуммаБонусов = БонусыВызовСервера.РассчитатьСуммуБонусов(Объект, Объект.Дата); 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
   
	КомандаСписать = Команды.Добавить("НачислитьБонусы");
	КомандаСписать.Действие = "НачислитьБонусы"; 
	КомандаСписать.Заголовок = "Начислить";
	
	КомандаСписать = Команды.Добавить("СписатьБонусы");
	КомандаСписать.Действие = "СписатьБонусы"; 
	КомандаСписать.Заголовок = "Списать";
	
	КомандаНастроить = Команды.Добавить("НастроитьБонусы");
	КомандаНастроить.Действие = "НастроитьБонусы";
	КомандаНастроить.Заголовок = "Настроить";
	
    ПодменюБонусы = Элементы.Добавить("ПодменюБонусы", 
        Тип("ГруппаФормы"), Элементы.ФормаКоманднаяПанель);
	ПодменюБонусы.Видимость = Ложь;	
	ПодменюБонусы.Вид = ВидГруппыФормы.Подменю;
    ПодменюБонусы.Заголовок = "Бонусы"; 
	
	КнопкаСписать = Элементы.Добавить("КнопкаНачислить", 
        Тип("КнопкаФормы"), ПодменюБонусы);
    КнопкаСписать.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
    КнопкаСписать.ИмяКоманды = "НачислитьБонусы";
	
	КнопкаСписать = Элементы.Добавить("КнопкаСписать", 
        Тип("КнопкаФормы"), ПодменюБонусы);
    КнопкаСписать.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
    КнопкаСписать.ИмяКоманды = "СписатьБонусы";
    
    КнопкаНастроить = Элементы.Добавить("КнопкаНастроить", 
        Тип("КнопкаФормы"), ПодменюБонусы);
    КнопкаНастроить.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
    КнопкаНастроить.ИмяКоманды = "НастроитьБонусы";

КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзмененииПосле(Элемент)
	
	// Проверим участие партнера в бонусной программе
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		Элементы.ПодменюБонусы.Видимость = БонусыВызовСервера.ПартнерУчаствуетВБонуснойПрограмме(Объект.Партнер);
	Иначе
		Элементы.ПодменюБонусы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытииПосле(Отказ)
	
	// Проверим участие партнера в бонусной программе
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		Элементы.ПодменюБонусы.Видимость = БонусыВызовСервера.ПартнерУчаствуетВБонуснойПрограмме(Объект.Партнер);
	Иначе
		Элементы.ПодменюБонусы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Функция НачислениеБонусовПослеНаСервере()
	Возврат БонусыВызовСервера.НачислитьБонусы(Объект.Ссылка, СуммаБонусов);
КонецФункции

&НаКлиенте
Процедура НачислитьБонусы(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
		БонусыВызовСервера.СообщитьПользователю(
		НСтр("ru = 'Сначала заполните поле Клиент и сохраните документ, затем повторите начисление бонусов'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		БонусыВызовСервера.СообщитьПользователю(НСтр("ru = 'Для начисления бонусов необходимо сначала записать документ'"));
		Возврат;
	КонецЕсли;
	
	Если БонусыВызовСервера.ЕстьНачислениеБонусов(Объект.Ссылка) Тогда
		БонусыВызовСервера.СообщитьПользователю(НСтр("ru = 'Бонусы уже были начислены по этому документу'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуНачисленияБонусов();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНачисленияБонусов()
	
	// Пересчет суммы бонусов, если ранее она не рассчитывалась
	Если ЭтотОбъект.СуммаБонусов = 0 Тогда
		РассчитатьСуммуБонусовНаФорме();
		
		// Повторная проверка суммы бонусов после пересчета
		Если ЭтотОбъект.СуммаБонусов = 0 Тогда
			БонусыВызовСервера.СообщитьПользователю(
			НСтр("ru = 'Сумма бонусов равна нулю. Начисление не требуется'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ДокументСсылка", Объект.Ссылка);
	ПараметрыОткрытияФормы.Вставить("Партнер", Объект.Партнер);
	ПараметрыОткрытияФормы.Вставить("Дата", Объект.Дата);
	ПараметрыОткрытияФормы.Вставить("БонусыКНачислению", ЭтотОбъект.СуммаБонусов);

	ОткрытьФорму("Обработка.БонуснаяСистема.Форма.ФормаНачисленияБонусов",
				ПараметрыОткрытияФормы, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры 

&НаКлиенте
Процедура СписатьБонусы(Команда)
		
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		БонусыВызовСервера.СообщитьПользователю(НСтр("ru = 'Для списания бонусов необходимо сначала записать документ'"));
		Возврат;
	КонецЕсли;
	
	Если БонусыВызовСервера.ЕстьСписаниеБонусов(Объект.Ссылка) Тогда
		БонусыВызовСервера.СообщитьПользователю(НСтр("ru = 'Бонусы уже были списаны по этому документу'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуСписанияБонусов();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьБонусы(Команда)

    ОткрытьФорму("Обработка.БонуснаяСистема.Форма.ФормаНастроекБонусов", , 
														, , , , , РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСписанияБонусов()
	
	СуммаДокумента = Объект.СуммаДокумента;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ДокументСсылка", Объект.Ссылка);
	ПараметрыОткрытияФормы.Вставить("Партнер", Объект.Партнер);
	ПараметрыОткрытияФормы.Вставить("СуммаДокумента", СуммаДокумента);
	
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ОбработкаЗакрытияСписания", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.БонуснаяСистема.Форма.ФормаСписанияБонусов", ПараметрыОткрытияФормы, 
														ЭтотОбъект, , , , ОповещениеЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияСписания(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И ЗначениеЗаполнено(Результат.СписаноБонусов) Тогда
		
		АдресВоВременномХранилище = АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилище(Ложь);
		
		НазначитьРучнуюСкидкуНаСервере(Результат.СписаноБонусов, Неопределено, АдресВоВременномХранилище);
		
		РассчитатьИтоговыеПоказатели();
		
		ЭтотОбъект.Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти


